## PROBLEM STATEMENT:

A leading retail company wants to better understand its customers' shopping behavior in order to improve sales, customer satisfaction, and long-term loyalty. The management team has noticed changes in purchasing patterns across demographics, product categories, and sales channels (online vs. offline). They are particularly interested in uncovering which factors, such as discounts, reviews, seasons, or payment preferences, drive consumer decisions and repeat purchases.


You are tasked with analyzing the company's consumer behavior dataset to answer the following overarching business question:

"How can the company leverage consumer shopping data to identify trends, improve customer engagement, and optimize marketing and product strategies?"

## DELIVERABLES:

1. Data Preparation & Modeling (Python): Clean and transform the raw dataset for analysis.
                                                                            
2. Data Analysis (SQL): Organize the data into a structured format, simulate business transactions, and run queries to extract insights on customer segments, loyalty, and purchase drivers.
    
3. Visualization & Insights (Power BI): Build an interactive dashboard that highlights key patterns and trends, enabling stakeholders to make data-driven decisions.

4. Report and Presentation: Write a clear project report summarizing your key findings and business recommendations. Prepare a presentation that visually communicates insights and actionable recommendations to stakeholders.
    
5. GitHub Repository: Include all Python scripts, SQL queries, and dashboard files in a well-structured repository.

In [1]:
import pandas as pd

df = pd.read_csv(r"C:\Users\OM SHARMA\Downloads\customer_shopping_behavior.csv")

In [2]:
# ## Creating connection between jupyter notebbook and SQL server 

# from sqlalchemy import create_engine
# from sqlalchemy.engine import URL
# import pandas as pd

# url = URL.create(
#     "mysql+pymysql",
#     username="root",
#     password="Madhu@0622",
#     host="localhost",
#     port=3306,   # MySQL default
#     database="property_casualty_insurance",
# )

# engine = create_engine(url)

In [ ]:
# code to push pandas dartaframe to SQL Server 

# df.to_sql(
#     "customer",
#     engine,
#     if_exists="replace",
#     index=False
# )

In [2]:
df.head()

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,Yes,14,Venmo,Fortnightly
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,Yes,2,Cash,Fortnightly
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,Yes,23,Credit Card,Weekly
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,Yes,49,PayPal,Weekly
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,Yes,31,PayPal,Annually

In [3]:
df.shape

(3900, 18)

In [4]:
df.columns

Index(['Customer ID', 'Age', 'Gender', 'Item Purchased', 'Category',
       'Purchase Amount (USD)', 'Location', 'Size', 'Color', 'Season',
       'Review Rating', 'Subscription Status', 'Shipping Type',
       'Discount Applied', 'Promo Code Used', 'Previous Purchases',
       'Payment Method', 'Frequency of Purchases'],
      dtype='object')

In [5]:
df.describe()

,Customer ID,Age,Purchase Amount (USD),Review Rating,Previous Purchases
count,3900.000000,3900.000000,3900.000000,3863.000000,3900.000000
mean,1950.500000,44.068462,59.764359,3.750065,25.351538
std,1125.977353,15.207589,23.685392,0.716983,14.447125
min,1.000000,18.000000,20.000000,2.500000,1.000000
25%,975.750000,31.000000,39.000000,3.100000,13.000000
50%,1950.500000,44.000000,60.000000,3.800000,25.000000
75%,2925.250000,57.000000,81.000000,4.400000,38.000000
max,3900.000000,70.000000,100.000000,5.000000,50.000000

In [5]:
df.describe(include = 'object')

,Gender,Item Purchased,Category,Location,Size,Color,Season,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Payment Method,Frequency of Purchases
count,3900,3900,3900,3900,3900,3900,3900,3900,3900,3900,3900,3900,3900
unique,2,25,4,50,4,25,4,2,6,2,2,6,7
top,Male,Blouse,Clothing,Montana,M,Olive,Spring,No,Free Shipping,No,No,PayPal,Every 3 Months
freq,2652,171,1737,96,1755,177,999,2847,675,2223,2223,677,584

In [6]:
df.isnull().sum()

Customer ID                0
Age                        0
Gender                     0
Item Purchased             0
Category                   0
Purchase Amount (USD)      0
Location                   0
Size                       0
Color                      0
Season                     0
Review Rating             37
Subscription Status        0
Shipping Type              0
Discount Applied           0
Promo Code Used            0
Previous Purchases         0
Payment Method             0
Frequency of Purchases     0
dtype: int64

In [7]:
## Filling missing/null values however making sure that it does not have any bias rating rather that filling it with dataframes median value we will  fill it by  each missing values with median of that category

df['Review Rating'] = df['Review Rating'].fillna(df.groupby('Category')['Review Rating'].transform('median'))

In [8]:
# df.groupby('Category')['Review Rating'].transform('median')

In [9]:
df.isnull().sum()

Customer ID               0
Age                       0
Gender                    0
Item Purchased            0
Category                  0
Purchase Amount (USD)     0
Location                  0
Size                      0
Color                     0
Season                    0
Review Rating             0
Subscription Status       0
Shipping Type             0
Discount Applied          0
Promo Code Used           0
Previous Purchases        0
Payment Method            0
Frequency of Purchases    0
dtype: int64

In [10]:
df.columns = df.columns.str.lower()

In [11]:
df.columns = df.columns.str.replace(' ','_')

In [12]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount_(usd)', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [13]:
df = df.rename(columns = {'purchase_amount_(usd)':'purchase_amount'})

In [14]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [15]:
##creating a column age_group

labels = ['Young Adult', 'Adult', 'Middle-aged', 'Senior']
df['age_group'] = pd.qcut(df['age'], q=4, labels = labels)

In [16]:
df[['age', 'age_group']]

      age    age_group
0      55  Middle-aged
1      19  Young Adult
2      50  Middle-aged
3      21  Young Adult
4      45  Middle-aged
...   ...          ...
3895   40        Adult
3896   52  Middle-aged
3897   46  Middle-aged
3898   44        Adult
3899   52  Middle-aged

[3900 rows x 2 columns]

In [17]:
 ## Creating a new colums to understand the customers Purchase frequency days

frequency_mapping = {
    'Fortnightly' : 14,
    'Weekly' : 7,
    'Monthly':30,
    'Quarterly': 90,
    'Bi-Weekly': 14,
    'Annually':365,
    'Every 3 Months':90
}

In [18]:
# df['frequency_of_purchases'].value_counts()

In [19]:
df['purchase_frequency_days'] = df['frequency_of_purchases'].map(frequency_mapping)

In [20]:
df[['purchase_frequency_days','frequency_of_purchases']]

      purchase_frequency_days frequency_of_purchases
0                          14            Fortnightly
1                          14            Fortnightly
2                           7                 Weekly
3                           7                 Weekly
4                         365               Annually
...                       ...                    ...
3895                        7                 Weekly
3896                       14              Bi-Weekly
3897                       90              Quarterly
3898                        7                 Weekly
3899                       90              Quarterly

[3900 rows x 2 columns]

In [21]:
# df['purchase_frequency_days'].isnull().sum()

In [22]:
(df['promo_code_used']== df['discount_applied']).all()

np.True_

In [23]:
## Since both columns have same information. Hence dropping any one of them

df.drop('promo_code_used',axis = 1,inplace = True)

In [24]:
df.columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchase_frequency_days'],
      dtype='object')

### Creating connection between jupyter notebbook and SQL server

In [25]:
## Creating connection between jupyter notebbook and SQL server 

from sqlalchemy import create_engine
from sqlalchemy.engine import URL
import pandas as pd

url = URL.create(
    "mysql+pymysql",
    username="root",
    password="Madhu@0622",
    host="localhost",
    port=3306,   # MySQL default
    database="customer_behaviour",
)

engine = create_engine(url)

In [26]:
# code to push pandas dartaframe to SQL Server 

df.to_sql(
    "customer",
    engine,
    if_exists="replace",
    index=False
)

3900

In [27]:
SQL = """select * 
from customer_behaviour.customer 
"""

# code to get  to SQL Server data into pandas dataframe 
df = pd.read_sql(SQL, engine)
df.head()

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,review_rating,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchase_frequency_days
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,14,Venmo,Fortnightly,Middle-aged,14
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,2,Cash,Fortnightly,Young Adult,14
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,23,Credit Card,Weekly,Middle-aged,7
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,49,PayPal,Weekly,Young Adult,7
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,31,PayPal,Annually,Middle-aged,365

## Q1. What is the total revenue generated by male vs. female customers?

In [28]:
SQL = """select gender,sum(purchase_amount)
from customer_behaviour.customer 
group by gender;"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

   gender  sum(purchase_amount)
0    Male              157890.0
1  Female               75191.0

## Q2. Which customers used a discount but still spent more than the average purchase amount?

In [31]:
SQL = """ select customer_id, purchase_amount
from customer
where discount_applied = 'Yes' and purchase_amount >=(select Avg(purchase_amount) from customer) """

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

     customer_id  purchase_amount
0              2               64
1              3               73
2              4               90
3              7               85
4              9               97
..           ...              ...
834         1667               64
835         1671               73
836         1673               73
837         1674               62
838         1676               90

[839 rows x 2 columns]

## Q3. Which are the top 5 products with the highest average review rating?

Python:

In [37]:


df1 = df.groupby('item_purchased').agg({'review_rating':'mean'}).reset_index()
df1.sort_values(by = 'review_rating', ascending = False, inplace = True)

In [38]:
df1.head()

   item_purchased  review_rating
6          Gloves       3.861429
14        Sandals       3.844375
3           Boots       3.818750
8             Hat       3.801299
19          Skirt       3.784810

SQL:

In [43]:
SQL = """ select item_purchased, Avg(review_rating)
from customer
group by item_purchased
Order by Avg(review_rating) desc
Limit 5;
"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

  item_purchased  Avg(review_rating)
0         Gloves            3.861429
1        Sandals            3.844375
2          Boots            3.818750
3            Hat            3.801299
4          Skirt            3.784810

## Q4. Compare the average Purchase Amounts between Standard and Express Shipping.

Python:

In [41]:
df['shipping_type'].value_counts()

shipping_type
Free Shipping     675
Standard          654
Store Pickup      650
Next Day Air      648
Express           646
2-Day Shipping    627
Name: count, dtype: int64

In [57]:
df1 = df.groupby('shipping_type').agg({'purchase_amount':'mean'}).reset_index()
df1

    shipping_type  purchase_amount
0  2-Day Shipping        60.733652
1         Express        60.475232
2   Free Shipping        60.410370
3    Next Day Air        58.631173
4        Standard        58.460245
5    Store Pickup        59.893846

In [63]:
df1 = df[df['shipping_type'].isin(['Standard','Express'])]
df1.head()

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,review_rating,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchase_frequency_days
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,14,Venmo,Fortnightly,Middle-aged,14
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,2,Cash,Fortnightly,Young Adult,14
5,6,46,Male,Sneakers,Footwear,20,Wyoming,M,White,Summer,2.9,Yes,Standard,Yes,14,Venmo,Weekly,Middle-aged,7
8,9,26,Male,Coat,Outerwear,97,West Virginia,L,Silver,Summer,2.6,Yes,Express,Yes,8,Venmo,Annually,Young Adult,365
12,13,61,Male,Coat,Outerwear,72,Delaware,M,Gold,Winter,4.5,Yes,Express,Yes,37,Venmo,Fortnightly,Senior,14

In [66]:
# df.query("shipping_type == 'Standard' or shipping_type == 'Express' ")
# df.query("shipping_type in ['Standard', 'Express']")

SQL:

In [56]:
SQL = """ Select shipping_type,ROUND(Avg(purchase_amount),2) as Avg_rating
from customer
where shipping_type in ('Standard','Express')
group by shipping_type
"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

  shipping_type  Avg_rating
0       Express       60.48
1      Standard       58.46

## Q5. Do subscribed customers spend more? Compare average spend and total revenue between subscribers and non-subscribers.

Python:

In [73]:
df.groupby('subscription_status').agg({'purchase_amount':['mean','sum','count']})

                    purchase_amount
                               mean     sum count
subscription_status
No                        59.865121  170436  2847
Yes                       59.491928   62645  1053

SQL:

In [77]:
SQL = """ Select subscription_status, round(Avg(purchase_amount),2) as avg_spent, round(sum(purchase_amount),2) as total_revenue, count(customer_id) as total_customers
from customer
group by subscription_status
"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

  subscription_status  avg_spent  total_revenue  total_customers
0                 Yes      59.49        62645.0             1053
1                  No      59.87       170436.0             2847

## Q6. Which 5 products have the highest percentage of purchases with discounts applied?

Python:

In [150]:
 #   Method 1 -->
    
 #   df['discount_applied_map'] = np.where(df['discount_applied'] == 'Yes', 1 ,0)

In [151]:
#Method 2 -->

#    def custom_map(x):
#        if x =='Yes':
#        return 1
#    else:
#        return 0

In [144]:
# Method 3 -->

    mapping = {'Yes': 1, 
           'No': 0}

df['discount_applied_map'] = df['discount_applied'].map(mapping)

In [145]:
df.head()

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,review_rating,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchase_frequency_days,discount_applied_map
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,14,Venmo,Fortnightly,Middle-aged,14,1
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,2,Cash,Fortnightly,Young Adult,14,1
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,23,Credit Card,Weekly,Middle-aged,7,1
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,49,PayPal,Weekly,Young Adult,7,1
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,31,PayPal,Annually,Middle-aged,365,1

In [148]:
dfs = df.groupby('item_purchased').agg({'discount_applied_map': 'sum', 'customer_id': 'count'}).reset_index()
dfs

   item_purchased  discount_applied_map  customer_id
0        Backpack                    64          143
1            Belt                    72          161
2          Blouse                    58          171
3           Boots                    67          144
4            Coat                    79          161
5           Dress                    75          166
6          Gloves                    60          140
7         Handbag                    61          153
8             Hat                    77          154
9          Hoodie                    68          151
10         Jacket                    65          163
11          Jeans                    57          124
12        Jewelry                    76          171
13          Pants                    81          171
14        Sandals                    59          160
15          Scarf                    67          157
16          Shirt                    71          169
17          Shoes                    61          150
18         Shorts                    68          157
19          Skirt                    61          158
20       Sneakers                    72          145
21          Socks                    52          159
22     Sunglasses                    66          161
23        Sweater                    79          164
24        T-shirt                    61          147

In [149]:
dfs['per%'] = round((dfs['discount_applied_map'] / dfs['customer_id'] ) * 100 ,0)
dfs.sort_values(by ='per%', ascending = False, inplace = True)
dfs.head()

   item_purchased  discount_applied_map  customer_id  per%
8             Hat                    77          154  50.0
20       Sneakers                    72          145  50.0
4            Coat                    79          161  49.0
23        Sweater                    79          164  48.0
3           Boots                    67          144  47.0

SQL:

In [153]:
SQL = """ Select item_purchased, round(100*sum(Case When discount_applied = 'Yes'Then 1 Else 0 End)/count(*),2) as discount_rate
from customer
group by item_purchased
order by discount_rate desc
limit 5
"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

  item_purchased  discount_rate
0            Hat          50.00
1       Sneakers          49.66
2           Coat          49.07
3        Sweater          48.17
4          Pants          47.37

## Q7. Segment customers into New, Returning, and Loyal based on their total number of previous purchases, and show the count of each segment

Python:

In [156]:
df['previous_purchases'].unique()

array([14,  2, 23, 49, 31, 19,  8,  4, 26, 10, 37, 34, 44, 36, 17, 46, 50,
       22, 32, 40, 16, 13,  7, 41, 45, 38, 48, 18, 15, 25, 39, 35, 29, 21,
       43,  3,  5, 24, 42, 47, 28, 20, 33,  1,  9, 12, 27, 11, 30,  6])

In [157]:
def segment_customers(x):
    if x ==1:
        return "New"
    elif x <=15:
        return "Returning"
    else:
        return "Loyal"

In [158]:
df['Customer_Segmentation'] = df['previous_purchases'].apply(segment_customers)

In [160]:
df.head(3)

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,...,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchase_frequency_days,discount_applied_map,Customer_Segmentation
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,...,Yes,Express,Yes,14,Venmo,Fortnightly,Middle-aged,14,1,Returning
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,...,Yes,Express,Yes,2,Cash,Fortnightly,Young Adult,14,1,Returning
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,...,Yes,Free Shipping,Yes,23,Credit Card,Weekly,Middle-aged,7,1,Loyal

In [165]:
df.groupby(['Customer_Segmentation','category']).agg({'previous_purchases':'count'})

                                   previous_purchases
Customer_Segmentation category
Loyal                 Accessories                 875
                      Clothing                   1209
                      Footwear                    425
                      Outerwear                   212
New                   Accessories                  28
                      Clothing                     28
                      Footwear                     15
                      Outerwear                    12
Returning             Accessories                 337
                      Clothing                    500
                      Footwear                    159
                      Outerwear                   100

SQL:

In [176]:
SQL = """ Select customer_id,sum(previous_purchases),item_purchased,category, 
case 
	when previous_purchases =1 then 'New'
	when  previous_purchases between 2 and 15 then 'Returning'
	else 'Loyal'
	end as customer_segment
from customer
group by customer_id,previous_purchases,item_purchased,category;
"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

,customer_id,sum(previous_purchases),item_purchased,category,customer_segment
0,1,14.0,Blouse,Clothing,Returning
1,2,2.0,Sweater,Clothing,Returning
2,3,23.0,Jeans,Clothing,Loyal
3,4,49.0,Sandals,Footwear,Loyal
4,5,31.0,Blouse,Clothing,Loyal
...,...,...,...,...,...
3895,3896,32.0,Hoodie,Clothing,Loyal
3896,3897,41.0,Backpack,Accessories,Loyal
3897,3898,24.0,Belt,Accessories,Loyal
3898,3899,24.0,Shoes,Footwear,Loyal
3899,3900,33.0,Handbag,Accessories,Loyal

## Q8. What are the top 3 most purchased products within each category?

Python:

In [196]:
df1 = df.groupby(['category','item_purchased']).agg({'customer_id':'count'}).reset_index().rename(columns = {'customer_id':'count_of_purchase'})
df1

       category item_purchased  count_of_purchase
0   Accessories       Backpack                143
1   Accessories           Belt                161
2   Accessories         Gloves                140
3   Accessories        Handbag                153
4   Accessories            Hat                154
5   Accessories        Jewelry                171
6   Accessories          Scarf                157
7   Accessories     Sunglasses                161
8      Clothing         Blouse                171
9      Clothing          Dress                166
10     Clothing         Hoodie                151
11     Clothing          Jeans                124
12     Clothing          Pants                171
13     Clothing          Shirt                169
14     Clothing         Shorts                157
15     Clothing          Skirt                158
16     Clothing          Socks                159
17     Clothing        Sweater                164
18     Clothing        T-shirt                147
19     Footwear          Boots                144
20     Footwear        Sandals                160
21     Footwear          Shoes                150
22     Footwear       Sneakers                145
23    Outerwear           Coat                161
24    Outerwear         Jacket                163

In [201]:
df1['Dense_rank'] = df1.groupby('category')['count_of_purchase'].rank(method = 'dense', ascending = False)
df1[df1['Dense_rank']<=3]

       category item_purchased  count_of_purchase  Dense_rank
1   Accessories           Belt                161         2.0
5   Accessories        Jewelry                171         1.0
6   Accessories          Scarf                157         3.0
7   Accessories     Sunglasses                161         2.0
8      Clothing         Blouse                171         1.0
9      Clothing          Dress                166         3.0
12     Clothing          Pants                171         1.0
13     Clothing          Shirt                169         2.0
20     Footwear        Sandals                160         1.0
21     Footwear          Shoes                150         2.0
22     Footwear       Sneakers                145         3.0
23    Outerwear           Coat                161         2.0
24    Outerwear         Jacket                163         1.0

In [202]:
df1.query("Dense_rank<=3")

       category item_purchased  count_of_purchase  Dense_rank
1   Accessories           Belt                161         2.0
5   Accessories        Jewelry                171         1.0
6   Accessories          Scarf                157         3.0
7   Accessories     Sunglasses                161         2.0
8      Clothing         Blouse                171         1.0
9      Clothing          Dress                166         3.0
12     Clothing          Pants                171         1.0
13     Clothing          Shirt                169         2.0
20     Footwear        Sandals                160         1.0
21     Footwear          Shoes                150         2.0
22     Footwear       Sneakers                145         3.0
23    Outerwear           Coat                161         2.0
24    Outerwear         Jacket                163         1.0

SQL:

In [191]:
SQL = """ with cte as(
select category,item_purchased,count(*) as count_of_purchase,dense_rank() over(partition by category order by count(*) desc) as rnk
from customer_behaviour.customer
group by category,item_purchased
)

select *
from cte
where rnk <=3; 
"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

       category item_purchased  count_of_purchase  rnk
0   Accessories        Jewelry                171    1
1   Accessories     Sunglasses                161    2
2   Accessories           Belt                161    2
3   Accessories          Scarf                157    3
4      Clothing         Blouse                171    1
5      Clothing          Pants                171    1
6      Clothing          Shirt                169    2
7      Clothing          Dress                166    3
8      Footwear        Sandals                160    1
9      Footwear          Shoes                150    2
10     Footwear       Sneakers                145    3
11    Outerwear         Jacket                163    1
12    Outerwear           Coat                161    2

## Q9. Are customers who are repeat buyers(more than 5 previous purchases) also likely to subscribe?

Python:

In [214]:
df_new = df[df['previous_purchases'] >5]
df_new

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,...,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchase_frequency_days,discount_applied_map,Customer_Segmentation
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,...,Yes,Express,Yes,14,Venmo,Fortnightly,Middle-aged,14,1,Returning
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,...,Yes,Free Shipping,Yes,23,Credit Card,Weekly,Middle-aged,7,1,Loyal
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,...,Yes,Next Day Air,Yes,49,PayPal,Weekly,Young Adult,7,1,Loyal
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,...,Yes,Free Shipping,Yes,31,PayPal,Annually,Middle-aged,365,1,Loyal
5,6,46,Male,Sneakers,Footwear,20,Wyoming,M,White,Summer,...,Yes,Standard,Yes,14,Venmo,Weekly,Middle-aged,7,1,Returning
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3895,3896,40,Female,Hoodie,Clothing,28,Virginia,L,Turquoise,Summer,...,No,2-Day Shipping,No,32,Venmo,Weekly,Adult,7,0,Loyal
3896,3897,52,Female,Backpack,Accessories,49,Iowa,L,White,Spring,...,No,Store Pickup,No,41,Bank Transfer,Bi-Weekly,Middle-aged,14,0,Loyal
3897,3898,46,Female,Belt,Accessories,33,New Jersey,L,Green,Spring,...,No,Standard,No,24,Venmo,Quarterly,Middle-aged,90,0,Loyal
3898,3899,44,Female,Shoes,Footwear,77,Minnesota,S,Brown,Summer,...,No,Express,No,24,Venmo,Weekly,Adult,7,0,Loyal
3899,3900,52,Female,Handbag,Accessories,81,California,M,Beige,Spring,...,No,Store Pickup,No,33,Venmo,Quarterly,Middle-aged,90,0,Loyal

In [215]:
df_new.groupby(['subscription_status']).agg({'customer_id':'count'})

                     customer_id
subscription_status
No                          2518
Yes                          958

SQL:

In [216]:
SQL = """ SELECT subscription_status,count(*)as repeat_customers
from customer_behaviour.customer
where previous_purchases>5
group by subscription_status;

"""

# code to get  to SQL Server data into pandas dataframe 
df_res = pd.read_sql(SQL, engine)
df_res

  subscription_status  repeat_customers
0                 Yes               958
1                  No              2518

## Q10. What is the revenue contribution of each age group?

Python:

In [226]:
df1 = df.groupby('age_group').agg({'purchase_amount':'sum'}).reset_index().rename(columns = {'purchase_amount':'revenue_contribution'})
df1['%_revenue_contribution'] = round(df1['revenue_contribution']/df1['revenue_contribution'].sum()*100,2)
df1

     age_group  revenue_contribution  %_revenue_contribution
0        Adult                 55978                   24.02
1  Middle-aged                 59197                   25.40
2       Senior                 55763                   23.92
3  Young Adult                 62143                   26.66

In [227]:
df.to_sql(
    "customer",
    engine,
    if_exists="replace",
    index=False
)


# code to get  to SQL Server data into pandas dataframe 
df_read = pd.read_sql("select * from property_casualty_insurance.p_c_insurance", engine)

In [229]:
import pandas as pd

In [238]:
df.to_csv(r"C:\Users\OM SHARMA\Desktop\Data_Analyst\Projects\Data_Analyst_project\New folder\clean_data.csv", index = False)

In [44]:
# SQL = """drop table t1 """
# # code to get  to SQL Server data into pandas dataframe 
# df_res = pd.read_sql(SQL, engine)
# df_res